Tekla Open API Reference for Tekla Structures 2025
Part.GetPartMark Method
 Returns the part mark.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GetPartMark()
Public Function GetPartMark As String
Return Value
Type: String
A string with the part mark.
See Also
Reference
Part Class
Tekla.Structures.Model Namespace